package com.zd.android.deam.appDeam.ui.weather.bean;

import java.util.List;

/**
 * Created by suzy on 2017/3/27.
 **/

public class HistoryInfo {

    /**
     * msg : success
     * result : [{"date":"18620327","day":27,"event":"　　１８６２年３月２７日，美商旗昌轮船公司在上海成立。旗昌轮船公司，亦名\u201c上海轮船公司\u201d，是美国在华旗昌洋行经营的企业之一。旗昌洋行原为美国资本最早侵入中国并依靠走私鸦片起家的商行。美商沙墨尔·罗塞尔于１８１８年在广州创立\u201c罗塞尔公司\u201d，俗称\u201c老旗昌\u201d，１８２４年改名\u201c旗昌洋行\u201d。初期经营鸦片走私，代美国和欧洲的公司在中国推售商品，采办丝茶。鸦片战争后，公行制度废除。旗昌势力伸入各通商口岸，早期驻华领事几乎都成为旗昌洋行股东。买办商人出身的苏松太道吴健彰也投资该行，为其七大股东之一。该行经营业务范围广泛，从鸦片走私扩大到进出口贸易，并建立航运公司、码头、仓库、以至开办机器缫丝和焙茶等厂，逐步成为１９世纪美国在华最大企业机构。旗昌轮船公司开业，资本大部是中国买办商人的投资，经营沪粤、长江两大航线。１８６７－１８７２年间垄断了长江航运。该行的全部业务在１８９１年清理结束。旗昌轮船公司是上海港第一家外商轮船公司。它的成立，说明第一次鸦片战争后，中外贸易中心由广州移到了上海，上海遂成为买办商人的主要活动场所。\n","id":"569881b1590146d407331cdb","month":3,"title":"美商旗昌轮船公司在上海成立"},{"date":"18980327","day":27,"event":"　　１８９８年３月２７日，清政府与沙俄签订《旅大租地条约》。１８９７年１２月１５日，沙俄借口协助中国抵抗德国强占胶州湾，派舰队占领旅顺。次年的３月２７日，清总理衙门大臣李鸿章与俄国驻华代办巴布罗福在北京签订此约。主要内容：一、租借旅顺口、大连湾，期限２５年；二、俄国享有租借地内行政权；三、旅顺军港只许中俄使用，俄国可在租地内建造各种军事设施；四、俄有修筑中东铁路支线的特权。同年５月７日又在圣彼得堡签订《续订旅大租地条约》六款，进一步确定俄国建筑及在租借地附近的独占权。两约的签订，使中国东北成为沙俄的势力范围。\n","id":"569881b1590146d407331cda","month":3,"title":"清政府与沙俄签订《旅大租地条约》"},{"date":"19000327","day":27,"event":"　　史良，１９００年３月２７日出生于江苏常州的一个清贫知识分子家庭，１９１３年开始先后入常州女子师范附孝常州女子师范学校就读。在校阅读进步书刊，受到新文化的启迪，参加五四运动，曾任常州市学生会副会长，领导全市学校的罢课。１９２３年，考入上海法科大学，攻读法律，积极参加上海工人和学生反帝爱国的五卅运动。１９２７年从法科大学毕业后，到南京政治工作人员养成所任指导员，因反对国民党的专横，被反动政府指控为共产党嫌疑而被捕入狱，经蔡元培先生等营救，始免于难。后在江苏临时地方法院任书记官，因曾入狱，而被停职。１９３１年开始在上海执行律师职务，前后近20年。在执行律师职务期间，做了不少有利于民主革命的工作，曾冒生命危险，营救一些受国民党政府迫害的共产党员和进步人士。\u201c九·一八\u201d事变后，日本帝国主义鲸吞我东北三省，并加紧侵略活动，企图把华北地区变成它的殖民地。国民党政府一面推行对日不抵抗政策，一面加紧反共进行内战。１９３５年８月１日，中共中央发表了《为抗日救国告全体同胞书》，号召全国团结起来，停止内战，一致抗日。在中国共产党抗日民族统一战线政策的影响下，上海的抗日救亡运动蓬勃发展，上海妇女界救国会率先成立，史良同志是发起人之一，并被推选为理事。上海文化界救国会成立后，史良同志被选为执行委员。１９３６年，日本帝国主义侵略气焰更加嚣张，民族危机进一步加深，５月３１日全国各界救国联合会正式成立，选举宋庆龄、沈钧儒等40余人为执行委员，史良同志是其中重要一员。为了推动国民党抗日，她曾同沈钧儒、章乃器、沙千里作为救国会的代表，到南京请愿，并积极参加抗日救亡的宣传活动。国民党政府顽固实行\u201c攘外必先安内\u201d的方针，于１１月２２日悍然逮捕了救国会领导人沈钧儒、章乃器、邹韬奋、李公朴、沙千里、王造时、史良，制造了震惊中外的\u201c七君子\u201d之狱。史良是\u201c七君子\u201d中唯一的女同志，她在狱中拒绝敌人的诱降阴谋，坚持爱国无罪的正义立场，直到七七抗战开始后，在全国人民的声援和中共中央的敦促下才被宋庆龄、何香凝、胡愈之等营救出狱。抗日战争胜利后，毛泽东主席、周恩来副主席到重庆，同蒋介石谈判，达成了\u201c双十协定\u201d，决定举行由各党派参加的政治协商会议（简称\u201c旧政协\u201d），共商国是。史良同志担任中国民主同盟代表团的顾问，她和民盟其他领导人一道，同中国共产党密切合作，为争取民主、反对独裁，争取和平、反对内战，同反动势力进行了不屈不挠的斗争。旧政协会议以后，史良同志回到上海，继续执行律师业务，同时积极参加民主革命活动。１９４７年１０月，国民党政府悍然宣布民盟为非法团体，迫使民盟停止公开活动。１９４８年１月，民盟在香港召开一届三中全会，决定同中国共产党紧密合作，为推翻蒋介石独裁政权和驱逐美帝国主义的势力为中国而斗争。史良同志因当时处境不能离沪赴港参加，曾委托赴港参加全会的沙千里同志代表她出席。随后她根据民盟总部决定，在上海建立了民盟华东执行部，并担任华东执行部主任。在白色恐怖下，史良同志机智顽强从事民盟的地下工作，在宣传民主，保护民盟组织，联系群众等方面做了许多工作。上海解放前夕，国民党反动派搜查了她的住宅，并密令逮捕她，在这危难时刻，上海解放了，史良同志才免遭毒手。１９４９年６月，史良同志到北平，参加中国人民政治协商会议（简称\u201c新政协\u201d）的筹备工作。９月，她以民盟代表的身份参加了中国人民政治协商会议第一届全体会议，并被选为第一届全国委员会委员。在上述历史进程中，她为民族、民主革命的胜利建立了不可磨灭的功绩。中华人民共和国成立后，史良被任命为司法部长和政务院政治法律委员会委员。通过法律来保障人民的民主权利，为人民服务，是史良的毕生志愿。她在任职司法部长的８年内，兢兢业业，勤奋工作，为奠定我国人民民主的法制基础，作出了重要的贡献。１９５７年以后，由于\u201c左\u201d的路线干扰，刚开始建立的法制遭到破坏，司法部被撤消，史良由司法部长改任人大常委委员。十年内乱开始后，史良也受到冲击，由于周恩来的保护，才免遭厄运。史良在人民共和国度过了３６个春秋，她铭记自己解放前说过的人民是主人、官吏是主人的公仆的话，全心全意为人民服务，为社会主义祖国服务，严于律己，自奉甚俭。解放后，她将自己在１９４８年承办一件大遗产案获得的上海十余幢房屋报酬全部献给国家，另一栋三层楼的６０余间房屋拨给民盟上海市委作办公用。１９８５年９月６日，史良因病逝世，身后没有给亲属留下任何遗产。\n","id":"569881b1590146d407331cd9","month":3,"title":"史良诞辰"},{"date":"19010327","day":27,"event":"　　1901年3月27日，无畏的菲律宾领导人埃米利欧·阿奎纳多被美国人抓获。他是在伊洛伊洛省的反抗头目投降后不到两个月被捕的。这鼓舞了华盛顿，使华盛顿有希望最终结束在菲律宾的这场长时间的反抗运动。\n　　逮捕这位反抗领导人的计划是由弗雷德里克 ·芬斯顿将军策划的。他化装成一名反抗者的囚犯，使阿奎纳多上当，暴露了他的司令部所在地。早在1898年美国接管菲律宾之前，阿奎纳多就已经是一位著名的民族主义领导人。1896年他领导了一次抗击西班牙长达400年之久统治的暴动。\n","id":"569881b1590146d407331cd8","month":3,"title":"美国抓获菲律宾的反抗运动领袖"},{"date":"19130327","day":27,"event":"　　1913年3月27日， 天津成立改良戏曲练习所。由原教育司蔡志庚主持，京剧改革家汪笑侬任所长，专门培养戏曲改良人才。招收学生数十名。\n　　课程设有喉音练习、词令、戏曲讲义、演说学、技术、拍歌、说白、剧文、国文、体操等。汪笑侬还亲撰戏剧教科书。\n","id":"569881b1590146d407331cd7","month":3,"title":"天津成立改良戏曲练习所"},{"date":"19380327","day":27,"event":"　　１９３８年３月２７日，中华全国文艺界抗敌协会（简称\u201c文协\u201d）在汉口成立。\u201c文协\u201d成立，是文艺界统一战线正式建立的标志。大会通过了\u201c文协\u201d宣言。宣言指出：对国内，我们必须喊出民族的危机，宣布日本的侵略罪状，造成民族严肃的抗战情绪生活，以求持久的抵抗，争取最后胜利。对世界，我们必须揭露日本的野心与暴行，引起人类的正义感，以共同制裁侵略者。大会选出郭沫若、茅盾、丁玲、田汉、巴金、冯玉祥等４５人为理事。５月４日，\u201c文协\u201d会刊《抗战文艺》在汉口创刊。\u201c文协\u201d先后在成都、昆明、桂林、贵阳、宜昌、襄樊、香港等地建立了分会。\n","id":"569881b1590146d407331cd6","month":3,"title":"中华全国文艺界抗敌协会成立"},{"date":"19410327","day":27,"event":"　　1941年3月，上海金星影片公司推出了柯灵编剧，吴仞之导演，罗从周摄影的《乱世风光》。\n　　《乱世风光》写抗战爆发后，孙伯修（石挥饰）的一家在战乱中失散了，妻子凌翠岚（于素莲饰）和女儿小翠（英子饰）逃到了上海，投亲不遇，寻访伯修又杳元消息，只好暂时寄寓下来。而孙伯修则在流亡途中结识了一个单身逃难的贵妇叶菲菲（端木兰心饰），也一同辗转来到了上海，并宣告同居。孙伯修靠了叶菲菲的财富，一帆风顺，做了乐丰银行的经理；而翠岚母女，则寂寞地过着贫困的岁月。\n　　一年半后，翠岚终因生活陷于绝境和小翠生病，在舞女柳如眉（陈璐饰）怂恿下，瞒了小翠去同乐丰银行副经理钱士杰（韩非饰）\u201c交际\u201d。孙伯修和翠岚意外地在很尴尬的场合下会见了。境遇悬殊，夫妻恍如路人；小翠觑破了母亲的\u201c交际\u201d生活，离别母亲，随着校长和同学们远赴内地。\n　　翠岚在绝望下投江自杀；孙伯修因投机失败和叶菲菲另投钱士杰，精神失常；而这时，小翠却正跟着她的同学们踏上光明的前途。\n","id":"569881b1590146d407331cd5","month":3,"title":"电影《乱世风光》再现孤岛上海"},{"date":"19460327","day":27,"event":"　　1946年3月27日，周恩来、张治中、吉伦军事三人小组签订《调处东北停战的协议》。\n　　1946年1月10日停战令发布时，国民政府代表坚持东北不在停战范围之内。政协会议结束后，国民政府在美国特使马歇尔和美国海军帮助下，大量运兵前往东北，扩大东北内阁。这次，经中共及全国人民的努力，国民政府勉强同意东北停战。\n","id":"569881b1590146d407331cd4","month":3,"title":"国共达成东北停战协议"},{"date":"19480327","day":27,"event":"　　1948年3月27日，戴着黑色眼镜，留着一把小胡子并戴着一个圆形无边毡帽的埃及国王法鲁克，把奠基石放在可以给他的国家争光的新水坝地基上。\n　　这个水力发电厂将建在尼罗河的上游，在这一段波涛滚滚的河水水势最强。建筑者估计这个发电厂的年发电量将到200万千瓦小时。\n　　和古代法老雕像所用的石料一样，采自相同的石料常那些纪念物是经过数十年建成的；法鲁克欧府预言水坝将在5年内建成。不太乐观的外界工程师认为需要12年才能完成。\n　　第一个阿斯旺水坝是1902年在英国支持下建成的。当前正在进行的工程主要由美国人和英国人共同资助。在建两个水坝之间为什么拖延这多么长时间？在着手治理这条最长的河流之前，埃及所需要的不仅仅是财政方面的支持者，它还需要重新安排成千上万人的动迁，需要权衡尼罗河流域的一些失掉了就无法补偿的罗马和埃及遗址的价值。\n","id":"569881b1590146d407331cd3","month":3,"title":"埃及国王为阿斯旺水坝奠基"},{"date":"19580327","day":27,"event":"　　1958年3月27日，赫鲁晓夫接替了辞职的尼古拉·布尔加宁的职务，成为两亿人口的苏联总理，同时继续担任共产党第一书记。\u201c我们必须以高水平的工作和更高的生活水平去战胜资本主义。\u201d这是尼基塔·赫鲁晓夫接替苏联领导职务时所做出的保证。\n　　自约瑟夫·斯大林以后还没有一位苏联领导人同时担任这两个重要职务。大多数苏联人是否赞成这两种权力集中于一身尚不得而知。\n","id":"569881b1590146d407331cd2","month":3,"title":"赫鲁晓夫接任苏联总理"},{"date":"19680327","day":27,"event":"　　加加林1934年3月9日生于苏联。他21岁参军，23岁从第一契卡洛夫军事航空飞行学校毕业后，驾驶过雅克-18、米格-15、米格-17、米格-21、伊尔-14等机型的飞机。加加林头脑清醒，技术全面，他的各种测验和考试成绩几乎都是优秀。1960年，他被选为宇航员。1961年4月12日，莫斯科时间9时7分，加加林驾驶着\u201c东方\u201d1号飞船从拜科努尔发射场起飞，以1小时48分的时间绕地球飞行1圈后安全返回，降落在萨拉托夫州斯梅洛夫卡村地区。加加林的成功使他两天后被授予\u201c苏联英雄\u201d称号。他驾驶的\u201c东方\u201d1号飞船成为世界上第一个载人进入外层空间的航天器。加加林完成了史无前例的宇宙飞行后，全世界都对他挥手致敬，到处都以鲜花迎接他，他的名字轰动一时。后来他去茹科夫斯基空军工程学院进修，并以优异的成绩毕业，学院推荐他到高等军事学院研究生院当函授生。正当加加林对未来充满信心的时候，灾难发生了。1968年3月27日，他在一次普通的飞行训练中因飞机失事遇难。这一天，加加林按计划要驾驶米格-15歼击教练机飞行两次，每次半小时。10点19分，飞机升空。10点30分，加加林把空域作业的情况报告飞行指挥，请求准许取航向320返航。此后，无线电通信突然中断，1分钟后，飞机一头栽到地上。事故发生后，政府成立了事故调查委员会。经过认真分析研究后认为：\u201c1968年3月27日飞机飞行准备工作完全是按照现有技术操作规程的要求进行的。\u201d调查委员会查明了飞机与地面相撞时的状态。当时，飞机在两层云带空域里飞行，看不见地平线。返航时，本应从70°航向向320°航向下降转弯，后来一定发生了某种突发事件，使飞机处于临界状态。飞机飞出低层云，航迹倾斜角达到70°到90°，飞机几乎是垂直俯冲下来，加加林和另外一位飞行员密切配合，想尽最大努力使飞机退出俯冲状态，但当时飞行高度只有250-300米，时间也只剩2秒钟了，他们没有成功，年仅34岁的加加林就这样离开了人世，以至于人们都不相信他真的牺牲了。为了纪念他，苏联把他的出生地改名为加加林区。国际航空联合会设立了加加林金质奖章。月球背面的一座环形山也是以他的名字命名的。加加林成为宇宙时代的象征。\n","id":"569881b1590146d407331cd1","month":3,"title":"世界第一位宇航员加加林遇难"},{"date":"19700327","day":27,"event":"　　1965年，西哈努克亲王与莫尼克公主同中共领导人毛泽东、刘少奇等在天安门城楼上。\n　　诺罗敦·西哈努克亲王的国际知名度很高，这源于他的不平凡的经历。西哈努克1922年生于金边。他登基当国王时，柬埔寨还是法属殖民地。在他不懈的努力下，1953年柬埔寨获得独立，他被誉为\u201c独立之父\u201d。而他在1955年3月2日发表声明，放弃王位，让位给他的父亲。1960年其父去世后，他宣布取消王位继承制度。1960年6月，他当选为国家元首。1970年3月，朗诺发动政变，西哈努克被废黜。他来到中国，得到中国至今几十年的支持。正如他一下飞机时，周恩来总理迎上去所说的那样，\u201c你仍是国家元首。我们永远不承认其他人。\u201d\n　　1973年3月，莫尼克公主为西哈努克与波尔·布特等抵抗力量领导人拍照\n　　国王加冕仪式时走向王位的西哈努克亲王\n　　柬埔寨的两位首相拉那烈和洪森\n","id":"569881b1590146d407331cd0","month":3,"title":"西哈努克国王被废黜"},{"date":"19730327","day":27,"event":"　　1973年3月，由美国派拉蒙公司出品的彩色故事片《教父》获第45届奥斯卡最佳影片奖；马龙·白兰度因在此片中的上乘表演获最佳男主角奖。该片由著名导演弗朗西斯·科波拉执导。\n　　此片根据马里奥·普左的名著《教父》改编，真实地再现了美国黑手党的内幕，上映后轰动了欧美国家，被认为是\u201c自《公民凯恩》以来最出色的一部美国影片\u201d。\n　　在1945年夏，美国东部黑手党科莱昂家族首领·教父科莱昂在举行女儿的婚礼，毒枭索洛佐前来谈判，失败，教父遭人枪击入医院，刚退役的小儿子迈克击毙索洛佐并且亡命西西里。而家族间仇杀愈演愈烈，教父的大儿子被杀，教父假装提出和解并传位于回到纽约的迈克，等科莱昂死后，新教父迈克开始了酝酿以久的复仇，经过血腥屠杀之后，迈克成了真正的教父，家族势力重新恢复。\n　　本片获第45届奥斯卡最佳影片，最佳男主角，最佳编剧等三项奖。\n","id":"569881b1590146d407331ccf","month":3,"title":"《教父》获第45届奥斯卡最佳影片等3项大奖"},{"date":"19740327","day":27,"event":"　　1974年3月27日王明在莫斯科病死。\n　　王明，原名陈绍禹。安徽六安人。1904年生。1925年赴苏联学习。1926年加入中国共产党。曾任莫斯科中山大学中共支部宣传干事、书记、组织宗派小集团。\n　　1929年回国后，任中共中央宣传部理论刊物《红旗》编辑。1930年发表《为中共更加布尔什维克化而斗争》的小册子。1931年1月在中共六届四中全会上当选为中央政治局委员、常委。同年9月去苏联任中共驻共产国际代表。仍通过博古推行\u201c左\u201d倾冒险主义，给中国革命事业造成极大损失。\n　　1937年11月回国，任中共中央长江局书记，推行\u201c一切经过统一战线，一切服从统一战线\u201d的右倾投降主义路线。1939年9月中共中央决定撤销长江局后，任中共中央统战部部长、中央党刊委员会主席。1941年后因病长期休息。1945年中共七大当选为中央委员。\n　　建国后，王明任政务院政治法律委员会副主任。1956年去苏联治玻中共八大仍被选为中央委员。\n　　后长期留居苏联，并化名马马维奇、波波维奇等，写了许多攻击中共的文章。\n","id":"569881b1590146d407331cce","month":3,"title":"王明在莫斯科病死"},{"date":"19800327","day":27,"event":"　　1980年3月27日长白山、卧龙、鼎湖山列入国际生物圈保护区。\n","id":"569881b1590146d407331c18","month":3,"title":"长白山、卧龙、鼎湖山列入国际生物圈保护区"},{"date":"19810327","day":27,"event":"　　茅盾生前照\n　　1981年3月27日，我国现代文学家茅盾逝世。茅盾是在国内外享有崇高声誉的著名作家。他同鲁迅、郭沫若一起，为我国革命文艺和文化活动奠定了基矗在他60多年的文学生涯中，创作了《子夜》、《蚀》、《虹》、《春蚕》、《林家铺子》、《霜叶红似二月花》、《清明前后》等大量杰出的文学作品，描述了中国民主革命的艰苦历程，丰富了我国文学宝库，提高了现实主义文学创作的水平，在现代文学史上留下了不可磨灭的功绩。茅盾不仅是位举世闻名的文学家，而且还是中国共产党最早的党员之一。1921年他就在上海加入了共产主义小组，同年，又加入了中国共产党。1928年他同党组织失去了联系，但他并没有改变对共产主义的信仰。他用自己的笔配合党的行动，从事进步文化活动。茅盾在三、四十年代曾两次要求恢复党的组织生活，但没有如愿以偿。解放后，共产党掌握了国家政权，茅盾认为这时候他不能去分享这个荣誉。他说，我就努力做个非党的布尔什维克吧，在党的领导下，做好分配给我的工作。于是，他不再提自己的入党问题。茅盾始终听从党的安排，严格要求自己。全国解放后，他想安心从事写作。毛泽东主席征求他的意见，想让他担任文化部的领导工作。茅盾从大局出发，欣然同意。这样，他只得放弃了原来的创作计划，《锻炼》这部小说的写作在完成第一部初稿后就基本停止了。十年浩劫使党的威信受到损害，有些人对党、对马列主义的信仰产生动遥茅盾对此深感忧虑。为了向党表示他对共产主义理想的信仰至死不变，在病危之际，口授了一封给党中央的信：&quot;亲爱的同志们，我自知病将不起，在这最后的时刻，我的心向着你们。为了共产主义的理想我追求和奋斗了一生，我请求中央在我死后，以党员的标准严格审查我一生的所作所为，功过是非。如蒙追认为光荣的中国共产党员，这将是我一生的最大荣耀&quot;。他用颤抖的手在信的末尾签上了自己的名字。中共中央收到茅盾的这封信后，根据他的请求和他一生的表现，决定恢复他的中国共产党党籍，党龄从1921年算起。这位伟大作家的夙愿终于实现了！茅盾的一生体现了\u201c文学家与革命家的完美结合。\u201d\n","id":"569881b1590146d407331ccd","month":3,"title":"现代文学巨匠茅盾逝世"},{"date":"19830327","day":27,"event":"　　1983年3月27日，在热那亚举行的意大利全国甲级队联赛，国际米兰队对热那亚队比赛中，米兰队一队员在双方打成2比2平局后又踢入一球获胜，热那亚队教练维塔大骂米兰队不守信用，违反了原定的\u201c互不侵犯默契\u201d。\n　　据说他们有6人把21000美元的赌注压在踢平局上。米兰队和热那亚队曾分别获得12次和9次甲级队联赛冠军。因这次事件，他们被降至乙级队。\n","id":"569881b1590146d407331ccc","month":3,"title":"意两支甲级足球劲旅因打假球被降级"},{"date":"19870327","day":27,"event":"　　1987年3月27日至29日在深圳举行，来自全国及香港14个队的314名弱智运动员，在国际特殊奥委会宣布的\u201c勇敢尝试，争取胜利\u201d的口号鼓舞下参加了田径、兵乓球、足球3个项目的比赛。\n　　第2届特奥会于1991年3月10日至12日在福州举行。\n","id":"569881b1590146d407331ccb","month":3,"title":"中国首届特殊奥运会举行"},{"date":"19930327","day":27,"event":"　　1993年3月15一31日，第八届全国人民代表大会第一次会议在京举行。3月27日，会议投票选举江泽民为中华人民共和国主席、中华人民共和国中央军事委员会主席。\n　　江泽民1926年8月17日生，江苏省扬州市人。中国共产党中央政治局常委、中央委员会总书记、中央军事委员会主席，中华人民共和国主席，中华人民共和国中央军事委员会主席。1943年起参加地下党领导的学生运动，1946年4月加入中国共产党，1947年毕业于上海交通大学电机系。\n　　上海解放后，历任上海益民食品一厂副工程师、工务科科长兼动力车间主任、厂党支部书记、第一副厂长，上海制皂厂第一副厂长，一机部上海第二设计分局电器专业科科长。1955年赴苏联莫斯科斯大林汽车厂实习。1956年回国后，任长春第一汽车制造厂动力处副处长、副总动力师、动力分厂厂长。1962年后任一机部上海电器科学研究所副所长，一机部武汉热工机械研究所所长、代理党委书记，一机部外事局副局长、局长。\n　　1980年后，任国家进出口管理委员会、国家外国投资管理委员会副主任兼秘书长、党组成员。1982年后，任电子工业部第一副部长、党组副书记，部长、党组书记。1985年后，任上海市市长，中共上海市委副书记、书记。\n　　1982年9月在中共第十二次全国代表大会上当选为中共中央委员。1987年11月在中共十三届一中全会上当选为中共中央政治局委员。1989年6月在中共十三届四中全会上当选为中共中央政治局常委，中共中央委员会总书记。1989年11月在中共十三届五中全会上当选为中共中央军事委员会主席。1990年3月在第七届全国人大第三次会议上当选为中华人民共和国中央军事委员会主席。1992年10月在中共十四届一中全会上当选为中央政治局委员、常委、中央委员会总书记、中央军事委员会主席。\n　　1998年3月，在第九届全国人大一次会议上，江泽民再次当选为中华人民共和国主席、中华人民共和国中央军事委员会主席。\n","id":"569881b1590146d407331cca","month":3,"title":"江泽民当选中华人民共和国主席"},{"date":"19960327","day":27,"event":"　　1996年3月27日，据报道北京医科大学人民医院肝病研究所应用基因诊断技术，最近在我国个体供血者、慢性肝炎患者和肝硬化患者的血液中，首次发现有庚型肝炎病毒感染，表明我国防治新型肝炎研究取得重大进展。\n　　在相当长的时间里，可明确诊断的肝炎病毒有甲、乙、丙、丁和戊型5种，其中，引起慢性肝炎及其它严重肝损害的是乙型和丙型这两种病毒，并主张通过血液传播。由于我国广泛使用了敏感、特异的诊断试剂进行检测，已能较好地控制这些病毒通过血液传播，并能通过临床进行80%的明确诊断。但是，对另外20%的慢性肝炎患者及输血后肝炎，一直未查出已知的肝炎毒型指标，说明肯定还有其它的未知肝炎病毒感染存在。\n　　1995年下半年至1996年1月，美国的两个实验室相继发表了一种非甲至戊型的新型肝炎病毒基因序列，把它初步命名为G型(我国称为庚型)肝炎病毒(HGV)。这种病毒与丙型肝炎病毒相似，其传播途径、致病性等也和丙肝病毒相似，可在人体长期存在。\n　　最近，北京医科大学人民医院肝病研究所在我国北方一个200多例的供血人群中，发现有8%的庚型肝炎病毒携带者。在通过有关序列分析得到确认后，他们又在甲至戊型肝炎病毒标志全阴的慢性肝炎患者、肝硬化患者的血清中也发现了庚型肝炎病毒。这个结果表明，输血是庚型肝炎病毒传播的重要途径；这种病毒在致慢性肝炎中起重要作用，很可能是继乙型、丙型肝炎病毒之后的我国第三大致慢性肝病的病毒。\n　　为尽快减少和控制庚型肝病毒的传播，这个曾于70年代首先研制出我国乙肝诊断试剂的肝病研究后，于近日研制出了庚型肝炎病毒基因诊断试剂，并已开始在临床中应用验证。\n","id":"569881b1590146d407331cc9","month":3,"title":"我国人群中发现庚型肝炎病毒"},{"date":"20000327","day":27,"event":"　　2000年3月27日，俄罗斯中央选举委员会主席韦什尼亚科夫宣布，根据对选票的初步统计结果，普京代总统的得票率已经超过50％，当选俄罗斯联邦第三届总统。上午10时韦什尼亚科夫宣布这一消息时，俄中央选举委员会已经统计出94．27％的选票，代总统普京获得52．52％的选票，超过法定票数。名列第二的是俄共主席久加诺夫，获得29．44％的选票。\u201c亚博卢\u201d集团领导人亚夫林斯基的得票率为5．85％，克麦罗沃州长图列夫的得票率为3．04％，位居第四，自由民主党主席日里诺夫斯基获得2．72％的选票，位居第五。俄罗斯共有登记选民1．08亿人，此次投票率为68．86％，超过法定50％的规定，因此本次总统选举被视为有效。俄中央选举委员会将在4月4日宣布大选的正式结果。普京1952年生于列宁格勒（今圣彼得堡），1975年毕业于国立列宁格勒大学，获经济学博士。他曾在苏联国家安全委员会对外情报局工作多年，后担任过圣彼得堡市第一副市长、国家安全局长、联邦安全会议秘书等职务。1999年8月出任政府总理，同年12月31日担任俄联邦代总统。\n","id":"569881b1590146d407331cc8","month":3,"title":"普京当选俄联邦第三届总统"},{"date":"6300327","day":27,"event":"　　唐初，东突厥首领颉利可汗曾率兵百万，长驱直抵长安附近的泪水北岸，对唐朝构成了很大的威胁。唐太宗李世民力图改变这种被动局面，作了军事上的准备。\n　　629年，东突厥的统治阶级内部矛盾日趋尖锐。\u201c颉利纵欲逞暴，诛忠良，匿奸佞\u201d，受迫害的部族纷纷叛高归后。\n　　629年9月，唐太宗任命李靖。李劲、柴绍等6人为行军总管，率大军10万，由李靖统一指挥，分路进攻东突厥。车场自马邑进电恶阳岭，夜袭定襄（今内蒙古和林格尔东北），额利可汗没有料想到李靖进兵如此神速，误认为李靖必有重兵作后盾。于是，慌忙北逃，把牙帐移至债四，李靖乘胜前进。\n　　630年3月27日（唐贞观四年二月八日），李靖与颉利可汗在阴山展开了大会战。李靖歼东突厥兵1万多人。\n　　颉利可汗退往铁山，李靖穷追猛打，生擒了颉利可汗，东突厥灭亡。\n","id":"569881b1590146d407331cdc","month":3,"title":"李靖大败突厥兵"}]
     * retCode : 200
     */

    private String msg;
    private String retCode;
    private List<ResultBean> result;

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public String getRetCode() {
        return retCode;
    }

    public void setRetCode(String retCode) {
        this.retCode = retCode;
    }

    public List<ResultBean> getResult() {
        return result;
    }

    public void setResult(List<ResultBean> result) {
        this.result = result;
    }

    public static class ResultBean {
        /**
         * date : 18620327
         * day : 27
         * event : 　　１８６２年３月２７日，美商旗昌轮船公司在上海成立。旗昌轮船公司，亦名“上海轮船公司”，是美国在华旗昌洋行经营的企业之一。旗昌洋行原为美国资本最早侵入中国并依靠走私鸦片起家的商行。美商沙墨尔·罗塞尔于１８１８年在广州创立“罗塞尔公司”，俗称“老旗昌”，１８２４年改名“旗昌洋行”。初期经营鸦片走私，代美国和欧洲的公司在中国推售商品，采办丝茶。鸦片战争后，公行制度废除。旗昌势力伸入各通商口岸，早期驻华领事几乎都成为旗昌洋行股东。买办商人出身的苏松太道吴健彰也投资该行，为其七大股东之一。该行经营业务范围广泛，从鸦片走私扩大到进出口贸易，并建立航运公司、码头、仓库、以至开办机器缫丝和焙茶等厂，逐步成为１９世纪美国在华最大企业机构。旗昌轮船公司开业，资本大部是中国买办商人的投资，经营沪粤、长江两大航线。１８６７－１８７２年间垄断了长江航运。该行的全部业务在１８９１年清理结束。旗昌轮船公司是上海港第一家外商轮船公司。它的成立，说明第一次鸦片战争后，中外贸易中心由广州移到了上海，上海遂成为买办商人的主要活动场所。

         * id : 569881b1590146d407331cdb
         * month : 3
         * title : 美商旗昌轮船公司在上海成立
         */

        private String date;
        private int day;
        private String event;
        private String id;
        private int month;
        private String title;

        public String getDate() {
            return date;
        }

        public void setDate(String date) {
            this.date = date;
        }

        public int getDay() {
            return day;
        }

        public void setDay(int day) {
            this.day = day;
        }

        public String getEvent() {
            return event;
        }

        public void setEvent(String event) {
            this.event = event;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public int getMonth() {
            return month;
        }

        public void setMonth(int month) {
            this.month = month;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        @Override
        public String toString() {
            return "ResultBean{" +
                    "date='" + date + '\'' +
                    ", day=" + day +
                    ", event='" + event + '\'' +
                    ", id='" + id + '\'' +
                    ", month=" + month +
                    ", title='" + title + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "HistoryInfo{" +
                "msg='" + msg + '\'' +
                ", retCode='" + retCode + '\'' +
                ", result=" + result +
                '}';
    }
}
